<template>
  <div class="div">
    <img class="rectangle-10335" src="/images/emailCertBack.png" />
    <div class="frame-3465953">
      <div class="group-1207">
        <div class="btn">
          <div class="rectangle-10317"></div>
          <div
            class="div4"
            style="cursor: pointer"
            @click="router.push('/login')"
          >
            초기화면으로 이동
          </div>
        </div>
        <div class="div5">
          회원가입 신청이 완료되었습니다<br />관리자의 승인 후 이용이 가능합니다
        </div>
        <div>
          <div class="bg"></div>
          <div class="heading">회원가입 신청완료</div>
        </div>
      </div>
      <div class="line-9"></div>
      <svg
        class="div6"
        width="305"
        height="32"
        viewBox="0 0 305 32"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M79.958 8.88877C78.9617 8.09865 78.4635 6.8679 78.4635 5.19651C78.4635 3.49473 78.991 2.2032 80.0459 1.32192C81.1302 0.44064 82.5954 0 84.4416 0C85.6138 0 87.5919 0.212723 90.3758 0.638168L93.3649 1.094C94.3612 1.21556 95.3722 1.27634 96.3979 1.27634C97.4529 1.27634 98.332 1.04842 99.0353 0.592585C100.09 1.56503 100.618 2.7502 100.618 4.14809C100.618 5.54598 100.017 6.74635 98.8155 7.74918C97.5847 8.8128 96.1781 9.3446 94.5957 9.3446C93.8338 9.3446 92.8374 9.23824 91.6066 9.02552C90.1707 13.7054 89.4527 17.6712 89.4527 20.9228C89.4527 24.1744 90.2439 26.6511 91.8264 28.3529C91.0938 29.7204 90.1853 30.6624 89.1011 31.1791C88.0168 31.7261 86.6541 31.9996 85.0131 31.9996C83.4013 31.9996 82.0826 31.5437 81.057 30.6321C80.0606 29.69 79.5624 28.2617 79.5624 26.3472C79.5624 24.1288 80.1485 21.1963 81.3207 17.5496C82.4929 13.9333 83.9581 10.7425 85.7164 7.9771C84.8666 7.88593 84.0021 7.84035 83.1229 7.84035C81.306 7.84035 80.2511 8.18982 79.958 8.88877Z"
          fill="#5783F6"
        />
        <path
          d="M74.1916 12.169C74.1916 25.1147 67.4222 31.5876 53.8835 31.5876C51.7149 31.5876 48.8431 31.3141 45.2679 30.7671L50.1911 3.82727C50.4255 2.61172 50.616 1.65447 50.7625 0.95552C55.2168 0.621241 58.4257 0.454102 60.3891 0.454102C62.3818 0.454102 64.2866 0.666824 66.1035 1.09227C67.9204 1.51771 69.4296 2.20147 70.631 3.14352C73.0047 4.99725 74.1916 8.00575 74.1916 12.169ZM65.1364 10.4825C65.1364 5.9545 63.5686 3.69053 60.4331 3.69053H59.9935C59.847 3.69053 59.7004 3.70572 59.5539 3.73611L55.0264 28.2144C55.1436 28.2752 55.2608 28.3056 55.378 28.3056H55.7297C56.8139 28.3056 57.9129 27.9561 59.0264 27.2572C60.1693 26.5582 61.1803 25.4946 62.0595 24.0663C64.1108 20.7539 65.1364 16.226 65.1364 10.4825Z"
          fill="#5783F6"
        />
        <path
          d="M29.4255 31.088L35.0081 1.00293H44.6786L39.0081 31.088H29.4255Z"
          fill="#5783F6"
        />
        <path
          d="M22.5059 31.9997C18.7549 31.9997 16.7036 29.2343 16.352 23.7035H8.79137C8.20528 25.1014 7.7071 26.4081 7.29684 27.6236L6.15396 31.088H0L13.8464 1.00293H23.2971L25.1433 23.1565C25.4364 26.3473 26.169 28.4138 27.3412 29.3558C26.4913 31.1184 24.8796 31.9997 22.5059 31.9997ZM10.154 20.3759H16.2201L15.6926 8.66094V7.43019L12.5717 14.5868L10.154 20.3759Z"
          fill="#5783F6"
        />
        <path
          d="M305 19.5102H301.016V1.94238H305V19.5102ZM292.378 12.3743V8.98229H295.247V2.35838H299.167V19.2862H295.247V12.3743H292.378ZM293.557 17.7182C290.242 18.3262 287.469 18.3902 283.134 18.3902H281.126V3.67036H292.155V6.99832H285.174V9.33429H291.135V12.5343H285.174V15.0622C288.234 15.0622 290.625 14.9022 293.207 14.3902L293.557 17.7182ZM305 20.6621V31.03H285.111V20.6621H305ZM300.888 27.7341V23.9581H289.254V27.7341H300.888Z"
          fill="black"
        />
        <path
          d="M275.168 19.3175C270.037 18.2935 266.339 15.4455 264.427 11.7016C262.514 15.4455 258.849 18.3255 253.717 19.3175L251.932 15.7975C258.562 14.6776 262.196 9.94161 262.196 5.74967V3.6377H266.69V5.74967C266.69 10.0056 270.323 14.6776 276.953 15.7975L275.168 19.3175ZM277.878 27.7974H251.295V24.3734H277.878V27.7974Z"
          fill="black"
        />
        <path
          d="M246.932 31.4456H242.725V1.87793H246.932V31.4456ZM233.991 8.46984C233.991 13.9418 236.318 19.3177 241.291 21.4617L238.9 24.8856C235.458 23.3497 233.258 20.4377 231.951 16.8217C230.645 20.8217 228.35 23.9256 224.748 25.5896L222.23 22.1017C227.362 19.8617 229.784 14.2298 229.784 8.46984V4.1819H233.991V8.46984Z"
          fill="black"
        />
        <path
          d="M218.342 31.4456H214.134V1.87793H218.342V31.4456ZM199.791 21.1097C204.253 21.1097 207.983 20.8217 212.094 20.1497L212.541 23.5737C207.696 24.4376 203.488 24.5976 198.134 24.5976H195.488V12.4698H205.018V7.76586H195.456V4.4059H209.321V15.7978H199.791V21.1097Z"
          fill="black"
        />
        <path
          d="M192.177 14.3578H188.671V23.9577H184.463V1.87793H188.671V10.8698H192.177V14.3578ZM176.813 14.0698C177.291 11.2538 177.419 9.20584 177.451 7.41386H166.518V4.0539H181.594V5.87788C181.594 7.92585 181.594 10.8058 180.925 14.5498L176.813 14.0698ZM183.124 18.7417C177.1 19.8617 170.215 20.0217 165.211 20.0217L164.829 16.6617C166.454 16.6617 168.271 16.6617 170.184 16.6297V10.9018H174.295V16.4697C177.228 16.3417 180.065 16.1177 182.869 15.7338L183.124 18.7417ZM189.595 27.5096V30.8696H169.1V22.0057H173.307V27.5096H189.595Z"
          fill="black"
        />
        <path
          d="M136.527 7.79845V4.50249H143.061V1.68652H147.301V4.50249H153.867L153.835 7.79845H136.527ZM159.668 12.4384V19.1583H155.46V1.91052H159.668V8.98243H163.556V12.4384H159.668ZM152.4 13.8144C152.4 16.8863 149.436 19.0303 145.197 19.0303C140.958 19.0303 137.993 16.8863 137.993 13.8144C137.993 10.6464 140.958 8.59844 145.197 8.59844C149.436 8.59844 152.4 10.6464 152.4 13.8144ZM142.01 13.8144C142.01 15.2224 143.285 15.9583 145.197 15.9583C147.109 15.9583 148.384 15.2224 148.384 13.8144C148.384 12.4064 147.109 11.6704 145.197 11.6704C143.285 11.6704 142.01 12.4064 142.01 13.8144ZM159.668 20.2783V31.0622H140.575V20.2783H144.751V22.5183H155.492V20.2783H159.668ZM144.751 25.7182V27.7662H155.492V25.7182H144.751Z"
          fill="black"
        />
        <path
          d="M134.394 20.4055H107.843V17.1096H118.999V15.2856H111.158V2.67773H131.366V5.87769H115.333V7.41367H130.697V10.4856H115.333V12.0856H131.589V15.2856H123.206V17.1096H134.394V20.4055ZM121.071 21.7175C127.796 21.7175 131.27 23.3495 131.27 26.5494C131.27 29.7494 127.796 31.3814 121.071 31.3814C114.409 31.3814 110.903 29.7494 110.903 26.5494C110.903 23.3495 114.409 21.7175 121.071 21.7175ZM121.071 28.3094C125.182 28.3094 127.031 27.7974 127.031 26.5494C127.031 25.3014 125.182 24.8215 121.071 24.8215C116.959 24.8215 115.142 25.3014 115.142 26.5494C115.142 27.7974 116.959 28.3094 121.071 28.3094Z"
          fill="black"
        />
      </svg>
    </div>
    <img class="div7" src="/images/logo/logo2.png" />
  </div>
</template>

<script setup lang="ts">
import { useRouter } from "vue-router";
const router = useRouter();
</script>

<style scoped>
.div,
.div * {
  box-sizing: border-box;
}

.div {
  background: #ffffff;
  height: 100%;
  width: 100%;
  top: 0;
  left: 0;
  position: absolute;
}

.div2 {
  position: absolute;
  inset: 0;
}

.rectangle-10335 {
  width: 100%;
  height: 100%;
  opacity: 0.5;
  position: absolute;
  left: 0px;
  top: 0px;
  object-fit: cover;
}

.div3 {
  opacity: 0.5;
  width: 1884.75px;
  height: 1355px;
  position: static;
}

.rectangle-10340 {
  background: #edf0f7;
  width: 1600px;
  height: 1355px;
  position: absolute;
  left: 0px;
  top: 0px;
}

.image-37 {
  width: 1884.75px;
  height: 1141.87px;
  position: absolute;
  left: -142.29px;
  top: 106.07px;
  object-fit: cover;
}

.frame-3465953 {
  background: #ffffff;
  border-radius: 20px;
  width: 440px;
  height: 640px;
  position: absolute;
  left: calc(50% - 220px);
  top: calc(50% - 319.5px);
  box-shadow: 0px 4px 60px 0px rgba(0, 0, 0, 0.4);
}

.group-1263 {
  position: absolute;
  inset: 0;
}

.group-1207 {
  width: 320px;
  height: 188px;
  position: static;
}

.btn {
  width: 320px;
  height: 46px;
  position: static;
}

.rectangle-10317 {
  background: var(--blue, #4876ef);
  border-radius: 6px;
  width: 320px;
  height: 46px;
  position: absolute;
  left: 60px;
  top: 429px;
}

.div4 {
  color: #ffffff;
  text-align: center;
  font-family: "SpoqaHanSansNeo-Medium", sans-serif;
  font-size: 16px;
  font-weight: 500;
  position: absolute;
  left: calc(50% - 59px);
  top: 442px;
  display: flex;
  align-items: center;
  justify-content: center;
}

.div5 {
  color: #373f57;
  text-align: center;
  font-family: "SpoqaHanSansNeo-Regular", sans-serif;
  font-size: 14px;
  line-height: 20px;
  font-weight: 400;
  position: absolute;
  left: calc(50% - 100px);
  top: 358px;
  display: flex;
  align-items: center;
  justify-content: center;
}

.tit {
  width: 250px;
  height: 50px;
  position: static;
}

.bg {
  background: #eff5ff;
  width: 250px;
  height: 25px;
  position: absolute;
  left: 95px;
  top: 312px;
}

.heading {
  color: #373f57;
  text-align: center;
  font-family: "SpoqaHanSansNeo-Bold", sans-serif;
  font-size: 36px;
  line-height: 50px;
  font-weight: 700;
  position: absolute;
  left: calc(50% - 150px);
  top: 287px;
  display: flex;
  align-items: center;
  justify-content: center;
}

.line-9 {
  border-style: solid;
  border-color: rgba(72, 118, 239, 0.3);
  border-width: 2px 0 0 0;
  width: 30px;
  height: 0px;
  position: absolute;
  left: calc(50% - 1px);
  top: 227px;
  transform-origin: 0 0;
  transform: rotate(90deg) scale(1, 1);
}

.div6 {
  width: 305px;
  height: 32px;
  position: absolute;
  left: 67px;
  top: 165px;
  overflow: visible;
}

.div7 {
  width: 280px;
  height: 120px;
  position: absolute;
  left: 60px;
  top: 60px;
  object-fit: cover;
}
.bg-back {
  background: #edf0f7;
  height: 100%;
  width: 100%;
}
</style>